app/views/events/index.html.erb


        <% Event.all.each do |event| %>
---
SELECT "events".* FROM "events"