app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.organizer = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]