app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "description" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Mathieu"], ["last_name", "Joly"], ["description", "cool cool"], ["updated_at", "2020-08-11 19:21:19.491868"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)